from PIL import Image, ImageDraw, ImageFont
from math import sqrt
#Исходные данные
Place_1=[[1,  1,1,2,  3,  3,'x',1,  1,  1,  1,  1,1,  1,  1,1],
         [1,  1,1,2,'x',  3,'x',1,  1,  1,  1,  1,1,  1,  1,1],
         [1,  1,1,1,'x',  4,'x',1,  1,  1,  1,'x',1,  1,  1,1],
         [1,'a',1,1,'x',  5,'x',1,  1,  1,  1,'x',1,  1,  1,1],
         [1,  1,1,1,'x',  5,'x',1,  1,'x','x','x',1,  1,  1,1],
         [1,  1,1,1,'x',  4,'x',1,  1,'x','x','x',1,  1,  1,1],
         [1,  1,1,1,'x',  3,'x',1,'x','x','x','x',1,  1,  1,1],
         [1,  1,1,1,'x',  3,'x',1,'x','x','x','x',1,  1,'b',1],
         [1,  1,1,1,'x',  2,  2,1,  1,'x','x','x',1,  1,  1,1],
         [1,  1,1,1,'x',  1,  1,1,  1,  1,'x','x',1,  1,  1,1],
         [1,  1,1,1,'x',  1,  1,2,  2,  2,'x','x',2,  2,  2,1],
         [1,  1,1,1,'x','x',  1,2,  3,  3,'x','x',3,  3,  2,1],
         [1,  1,1,1,  1,'x',  1,2,  3,  4,'x','x',4,  3,  2,1],
         [1,  1,1,1,  1,'x',  1,2,  3,  4,  5,  5,4,  3,  2,1],
         [1,  1,1,1,  1,'x',  1,2,  3,  4,  5,  5,4,  3,  2,1],
         [1,  1,1,1,  1,  1,  1,2,  3,  4,  5,  5,4,  3,  2,1]]

#Заготовка фона
PL = Image.new('RGB', (1600, 1600), (255,255,255))
re_PL = ImageDraw.Draw(PL)
front=ImageFont.truetype("arial.ttf", 20)

#Функция разметки пространства
def ShowPlace(Place):
    n=0
    for i in Place:
        n+=1
        m=0
        for j in i:
            m+=1
            if j=='x':
                re_PL.rectangle((m*100-100, n*100-100, m*100, n*100), fill='black',outline=(255, 255, 255))
            elif j=='a' or j=='b':
                re_PL.rectangle((m*100-100, n*100-100, m*100, n*100), fill='yellow',outline=(0, 0, 0))
                re_PL.text((m*100-80, n*100-80),j, fill='black', font=front)
            else:
                re_PL.rectangle((m*100-100, n*100-100, m*100, n*100), fill='white',outline=(0, 0, 0))
                re_PL.text((m*100-80, n*100-80),str(j), fill='black', font=front)

contin=0
ShowPlace(Place_1)
PL.show()
##################################################################################
